[
    {
        "npcName":"Intro",
        "Sentences":
        [
            {
                "ID":"ID1",
                "Sentence":"What a storm!  Where am I?",
                "Responses":
                [
                    {
                        "Respone":"Continue..."
                    }
                ]
            }
        ]
    },
    {
        "npcName": "NPC1",
        "Sentences":
        [
            {
                "ID": "ID1",
                "Sentence": "Oh! Hey! You’re alive, oh I mean, wow! that must have been a rough trip! Your boat just came in on a giant wave, and…. Oh where are my manners!",
                "Responses":
                [
                    {
                        "Response": "Continue...",
                        "NextSentence": "ID1A"
                    }
                ]
            },
            {
                "ID":"ID1A",
                "Sentence":"You barely hear her say ‘okay friendly smile, wave hand, and welcome her, come on, you can do this…’",
                "Responses":
                [
                    {
                        "Response":"Continue...",
                        "NextSentence":"ID1B"
                    }
                ]
            },
            {
                "ID":"ID1B",
                "Sentence":"WELCOME TO THE ISLAND! MY NAME IS SUNBREEZE, I HOPE YOU ENJOY YOUR TIME HERE! ARE YOU HUNGRY?! I CAN GET YOU SOME FOOD!’",
                "Responses":
                [
                    {
                        "Response":"Continue...",
                        "NextSentence":"ID2"
                    }
                ]
            },
            {
                "ID": "ID2",
                "Sentence": "[You and Sunbreeze share an awkward look.]",
                "Responses":
                [
                    {
                        "Response": "Trust",
                        "NextSentence": "ID2A"
                    },
                    {
                        "Response": "Don't Trust",
                        "NextSentence": "ID2B"
                    }
                ]
            },
            
            {
                "ID": "ID2A",
                "Sentence": "[You go with Sunbreeze and she takes you to a place serving pineapple salad with a nutty sauce]",
                "Responses":
                [
                    {
                        "Response": "Continue...",
                        "NextSentence": "ID3"
                    }
                ]
            },
            
            {
                "ID": "ID2B",
                "Action1": "[You think about it and move towards your boat which looks it’s in terrible condition, but logically you should not trust strangers especially with what happened in your last island. And this person is just has a serious weirdo vibe]",
                "Sentence": "WAIT! Okay… sorry… sorry… that was pretty awkward…. You just look like you’ve had a rough day, and I’m just trying to help. Please get yourself something to eat before you go back out there or you’ll starve to death….",
                "Action2": "[You go with Sunbreeze and she takes you to her home where she gives you some sun baked potatoes]",
                "Responses":
                [
                    {
                        "Response": "Continue...",
                        "NextSentence": "ID3"
                    }
                ]
            },
            
            {
                "ID": "ID3",
                "Sentence": "So welcome to the island. Please feel free to walk around and meet the neighbors! I would show you around but it’s about time to harvest the sun apples. Remember a sun apple a day keeps the sunshine all day… in your heart!",
                "Action1": "Amelie and Sunbreeze share another awkward look",
                "Responses":
                [
                    {
                        "Response": "Continue...",
                        "NextSentence": "ID4"
                    }
                ]
            },
            
            {
                "ID": "ID4",
                "Sentence": "BYE!!!",
                "Action1": "Sunbreeze scampers away and trips mid way. She gets up, brushes herself off and scampers the rest of the way.",
                "Responses":
                [
                    {
                        "Response": "Continue..."
                    }
                ]

            }
            
        ]
    },
    {
        "npcName": "NPC2",
        "Sentences":
        [
            {
                "ID": "ID1",
                "Sentence": "Stop right there or prepared to be slimed!",
                "Responses":
                {
                    "Response":"Continue...",
                    "NextSentence":"ID2"
                }
            },
            {
                "ID":"ID2",
                "Sentence": "What are you doing here?! Who are you?! Why are you on my property?! What are you after?! You know what?! You’ve got 3 seconds! You know what, just get out of here! I’ve got a ber…. Very big saw and I know how to use it!",
                "Responses":
                [
                    {
                        "Response":"Stand your ground",
                        "NextSentence":"ID2A"
                    },
                    {
                        "Response":"Back Off",
                        "NextSentence":"ID2B"
                    }
                ]
            },
            {
                "ID":"ID2A",
                "Sentence":"Whoa! We got a hot shot here! Next time I see you… you know what? There won’t be a next time, you better watch yourself. Hmph!",
                "Responses":
                [
                    {
                        "Response":"Continue..."
                    }
                ]
            },
            {
                "ID":"ID2B",
                "Sentence":"Hah! That’s what I thought! You best watch yourself. I better not see you on my property again.",
                "Responses":
                [
                    {
                        "Response":"Continue..."
                    }
                ]
            }
        ]
    }
]